TwoPhaseFlow-master/testsuite/phaseChange/stefanProblem/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 -0.0)
    (10 0 -0.0)
    (10 0.2 -0.0)
    (0 0.2 -0.0)
    (0 0 0.02)
    (10 0 0.02)
    (10 0.2 0.02)
    (0 0.2 0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 1)
    simpleGrading (1 1 1)
);

patches
(
   /* wall sideWalls
    (
        (1 5 4 0)
        (3 7 6 2)
    )*/
    wall faceWall
    (
      (0 4 7 3)
    )

    patch outlet
    (
      (2 6 5 1)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
        (1 5 4 0)
        (3 7 6 2)

    )
);

// ************************************************************************* //
